#  Проверка значения на цифру
# day.isdigit() == True

# Проверка значения на принадлежность к диапазону
# day == range (1,8)

# \n - переход на новую строку в выводимом тексте

# while not (day in [1,2,3,4,5,6,7]) пример условия

# from unittest import result

# def logic (x,y,z): Пример функции
#     .....
#     return result

# f1 = logic (True,False,True) Вызов функции
# f2 = ...

# if (all([f1,f2, ...])) Проверка на истинность всех элементов

# print ('_'*100) - напечатать _ 100 раз

# \t	(tab) табуляция (отступ, красная строка)
    